Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་གཏོགས་པར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་པར་སྤྱོད་པ་དེ་ལྟ་བུ་ནི་སེམས་ཅན་གང་ལ་ཡང་མེད་དེ།
en: If you ask why, it is because, with the exception of the tathāgatas, arhats, completely awakened buddhas, there is no being at all who has the sort of engagement that bodhisattva great beings undertake.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱམས་པ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་སྟེ།
en: If you ask why, it is because when those noble children practice the perfection of wisdom, they actualize great loving kindness.

source: དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཐམས་ཅད་གསད་པར་འགྱུར་བ་དང་འདྲ་བར་ལྟ་སྟེ། དེ་དག་སྙིང་རྗེ་ཆེན་པོ་འཐོབ་བོ།
en: When they practice the perfection of wisdom, they observe that all beings are, as it were, about to be slaughtered and they acquire great compassion.

source: །དེ་དག་རྣམ་པར་སྤྱོད་པ་དེས་རྣམ་པར་སྤྱོད་པས། དགའ་བས་རབ་ཏུ་དགའ་བ་དང་། མངོན་པར་དགའ་བར་འགྱུར་ཏེ། དེ་དག་དགའ་བ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་བོ།
en: Engaging with that practice, they rejoice and manifestly rejoice, actualizing great empathetic joy.

source: །དེ་དག་མཚན་མ་དེ་དང་ལྷན་ཅིག་ཏུ་མི་གནས་ཏེ། དེ་དག་བཏང་སྙོམས་ཆེན་པོ་འཐོབ་བོ།
en: Without getting involved with those distinguishing marks, they acquire great equanimity.

source: །རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་སྣང་བ་ཆེན་པོ་སྟེ།
en: This, Subhūti, is the supreme light of the perfection of wisdom that bodhisattva great beings possess.

source: འདི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྣང་བའོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Accordingly, it is the light of the perfection of generosity, and it is the light of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་སྣང་བའོ། །རིགས་ཀྱི་བུ་དེ་དག་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྦྱིན་པའི་གནས་སུ་འགྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་གོ །
en: Even those noble children who have not yet attained all-aspect omniscience, consummate buddhahood, become worthy recipients of the donations of all beings, and they do not turn away from unsurpassed, complete enlightenment. “

source: དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་རྣམ་པར་སྤྱོད་པའི་ཕྱིར་སུའི་གོས་དང་། བསོད་སྙོམས་དང་།
en: Since they practice while focusing their attention with the perfection of wisdom in mind, {Ki.

source: མལ་ཆ་དང་། ནད་ཀྱི་རྐྱེན་རྩི་དང་། ཡོ་བྱད་ལ་ཡོངས་སུ་སྤྱོད་པའི་གཏོང་བ་དང་། སྦྱིན་བདག་གི་སྦྱིན་པ་དག་པར་འགྱུར་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་འགྱུར་རོ།
en: V: 15} they purify the donations of those patrons who give them clothing, alms, bedding, medicines, and necessities, and they also approach all-aspect omniscience.

source: །རབ་འབྱོར་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དོན་ཡོད་པར་ཁམས་ཀྱི་བསོད་སྙོམས་ལ་ཡོངས་སུ་སྤྱད་པར་འདོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལམ་བསྟན་པར་འདོད་པ་དང་། སྣང་བ་ཆེན་པོ་དབྱུང་བར་འདོད་པ་དང་། ཁམས་གསུམ་གྱི་བཙོན་ར་ན་གནས་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་དགྲོལ་བར་འདོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བླ་ན་མེད་པའི་ཤེས་རབ་ཀྱི་མིག་བསྐྱེད་པར་འདོད་པས།
en: So it is, Subhūti, that bodhisattva great beings who seek to use the country’s alms in a meaningful way, who seek to reveal the path to all beings, who seek to bring forth great luminosity, who seek to liberate beings imprisoned in the three realms, and who seek to develop the eye of unsurpassed wisdom in all beings should at all times and without interruption keep focusing their attention with the perfection of wisdom in mind.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་གནས་པར་བྱའོ། །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བར་རྣམ་པར་སྤྱོད་ན་ཡང་། དེས་ཡིད་ལ་བྱ་བ་གཞན་གྱི་གོ་མི་དབྱེ་སྟེ།
en: Even if bodhisattva great beings engage in focusing their attention with the perfection of wisdom in mind, they should give no opportunity for other mental activities to arise.

source: དེས་ཅི་ནས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་ཉིད་ཀྱིས་ཉིན་མཚན་དུ་མི་གཏོང་ཞིང་བརྩོན་པར་གནས་པ་དེ་ལྟར་བྱའོ།
en: By all means they should continue to persevere in focusing their attention with the perfection of wisdom in mind, without forsaking it, day and night. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྔོན་ཆད་ནོར་བུ་རིན་པོ་ཆེ་རྙེད་མ་མྱོང་བའི་སྐྱེས་བུ་ཞིག་ཡོད་ལ། དེས་དུས་གཞན་ཞིག་ན་ནོར་བུ་རིན་པོ་ཆེ་རྙེད་པར་གྱུར་ཏེ། དེས་ནོར་བུ་རིན་པོ་ཆེ་དེ་རྙེད་པས་དགའ་བ་དང་། སྤྲོ་བ་དང་།
en: Subhūti, this is just as if a man who has not previously found a precious gem were to find a precious gem at a certain moment, and rejoice, delight, and be contented through finding that precious gem.

source: ཡིད་བདེ་བ་དང་ལྡན་པར་གྱུར་པ་ལས། དེས་ནོར་བུ་རིན་པོ་ཆེ་དེ་རྙེད་མ་ཐག་ཏུ་སྟོར་བར་གྱུར་ན། དེའི་རྒྱུས་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་ཏེ།
en: But if immediately after finding that precious gem he were to lose it, because of that he would be sad and distressed.

source: རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ཀྱི་ཧུད་བདག་ནི་ཡིད་དུ་འོང་བའི་ནོར་བུ་རིན་པོ་ཆེ་དེ་དང་བྲལ་བར་གྱུར་ཏོ་ཞེས།
en: His attention would be constantly focused exclusively on that precious gem, at all times and without interruption, with the thought, ‘Alas!

source: ནོར་བུ་རིན་པོ་ཆེ་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་ཤ་སྟག་རྒྱུན་དུ་འབྱུང་ངོ་།
en: I have let go of that lovely precious gem!’

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་ནི་རིན་པོ་ཆེའོ་སྙམ་དུ་བསམས་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་མ་བྲལ་བར་བྱའོ།
en: In the same way, Subhūti, bodhisattva great beings, considering it to be precious, should not part from focusing their attention with all-aspect omniscience in mind.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རིན་པོ་ཆེ་དེ་སྟོར་བར་ཡང་མི་བྱ་སྟེ། དེ་ལྟར་ན་རྟག་ཏུ་བདེ་བ་དང་། ཡིད་བདེ་བ་མང་པོ་དང་ལྡན་པར་འགྱུར་རོ། །གསོལ་པ།
en: They should not let go of that precious thing that is all-aspect omniscience, and in that way they will always have much happiness and contentment.” “

source: བཅོམ་ལྡན་འདས་ཡིད་ལ་བགྱི་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རང་བཞིན་དང་བྲལ་བ་སྟེ། ཡིད་ལ་བགྱི་བ་ཐམས་ཅད་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པ་ལགས་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བགྱི་བ་དང་མ་བྲལ་བ་ལགས།
en: Blessed Lord, if all such acts of attention are indeed without inherent existence—that is to say, if all acts of attention are indeed empty of inherent existence—how could bodhisattva great beings not part from focusing their attention with all-aspect omniscience in mind?

source: བྲལ་བ་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས། ཡིད་ལ་བགྱི་བ་མི་དམིགས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མི་དམིགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: In that parting, a bodhisattva is not apprehended, focusing of the attention is not apprehended, and all-aspect omniscience is not apprehended.” “

source: རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་དང་བྲལ་བ་སྟེ། དེ་དག་ནི་ཉན་ཐོས་ཀྱིས་མ་བྱས། རང་སངས་རྒྱས་ཀྱིས་མ་བྱས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་མ་མཛད་དེ། ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་།
en: Subhūti,” replied the Blessed One, “if bodhisattva great beings know that all phenomena are without inherent existence—that they have not been made by the śrāvakas, they have not been made by the pratyekabuddhas, and they have not even been made by the lord buddhas—but that this reality of all phenomena, the abiding nature of reality, the maturity with respect to all phenomena, {Ki.

source: གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཡང་དག་པའི་མཐའ་འདི་ནི་གནས་པ་ཡིན་ནོ། །ཞེས་བྱ་བར་ཤེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བ་ཡིན་ཏེ།
en: V: 16} the real nature, the unmistaken real nature, the one and only real nature, the realm of phenomena, and the very limit of reality are established, then those bodhisattva great beings are not without the perfection of wisdom.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རང་བཞིན་གྱིས་དབེན།
en: If you ask why, Subhūti, it is because the perfection of wisdom is devoid of inherent existence.

source: རང་བཞིན་གྱིས་སྟོང་པ་སྟེ།
en: It is empty of inherent existence.

source: དེ་ལ་འཕེལ་བ་མེད་དོ། །ཡོངས་སུ་འགྲིབ་པ་མེད་དོ། །གསོལ་པ།
en: In it there is no increase and there is no decrease.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རང་བཞིན་གྱིས་དབེན་ཞིང་། རང་བཞིན་གྱིས་སྟོང་པ་ལགས་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བྱུང་ཞིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, if the perfection of wisdom is devoid of inherent existence and it is empty of inherent existence, then, Blessed Lord, how do bodhisattva great beings genuinely bring forth the perfection of wisdom and attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བྱུང་ཡང་འཕེལ་བ་འམ་ཡོངས་སུ་འགྲིབ་པ་མེད་དེ།
en: Subhūti,” replied the Blessed One, “even though bodhisattva great beings genuinely bring forth the perfection of wisdom, it is without increase or decrease.

source: དེ་བཞིན་ཉིད་ལ་འཕེལ་བ་འམ་ཡོངས་སུ་འགྲིབ་པ་མེད་དོ།
en: The real nature is without increase or decrease.

source: །ཆོས་ཀྱི་དབྱིངས་ལ་འཕེལ་བ་འམ་ཡོངས་སུ་འགྲིབ་པ་མེད་དོ།
en: The realm of phenomena is without increase or decrease.

source: །ཡང་དག་པའི་མཐའ་ལ་འཕེལ་བ་འམ་ཡོངས་སུ་འགྲིབ་པ་མེད་དོ།
en: The very limit of reality is without increase or decrease.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གཅིག་ཀྱང་མ་ཡིན། གཉིས་ཀྱང་མ་ཡིན་ནོ། །རབ་འབྱོར་གལ་ཏེ་དེ་སྐད་དུ་བཤད་པ་ལ།
en: If you ask why, it is because the perfection of wisdom is neither one nor two. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མི་འཇུམ་མི་འགོང་མི་འཇིགས་མི་སྔང་། སྐྲག་པར་མི་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པའི་དབྱིངས་ལ་གནས་པ་སྟེ།
en: Subhūti, great bodhisattvas who are not discouraged, cowed, afraid, terrified, or fearful when this is explained will dwell irreversibly in the expanse.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཞེས་བྱ་བར་རྟོགས་པར་རིག་པར་བྱའོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: One should know with certainty that these bodhisattva great beings practice the perfection of wisdom.”

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སྟོང་པ་ཉིད་དང་། གསོག་ཉིད་དང་། གསོབ་ཉིད་དང་། རག་ལུས་པ་ཉིད་དང་། སྙིང་པོ་མ་མཆིས་པ་གང་ལགས་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ།
en: Subhūti then asked, “Blessed Lord, is it this [very] perfection of wisdom, which is emptiness, voidness, vacuity, hollowness, and essencelessness, that engages in the perfection of wisdom?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ།
en: No, Subhūti!”

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་གུད་ན་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཆོས་གང་ཡང་དམིགས་སུ་མཆིས་སམ།
en: Blessed Lord, is there anything apprehensible apart from the perfection of wisdom that engages in the perfection of wisdom?” “No, Subhūti!”

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, is it the perfection of wisdom that engages in the perfection of wisdom?” “

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ།
en: No, Subhūti!”

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ལ་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, is it emptiness that engages in emptiness?” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། སྟོང་པ་ཉིད་ལས་གུད་ན་སྟོང་པ་ཉིད་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, is it something other than emptiness that engages in emptiness?” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། གཟུགས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ།
en: Blessed Lord, is it physical forms that engage in the perfection of wisdom?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Is it feelings, perceptions, formative predispositions, and consciousness that engage in the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: V: 17} “Blessed Lord, is it the sense fields, the sensory elements, and the links of dependent origination that engage in the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, is it the perfections, all the aspects of emptiness, and the factors conducive to enlightenment that engage in the perfection of wisdom?” “

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ། །གསོལ་པ།
en: No, Subhūti!”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: replied the Blessed One. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, is it the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas that engage in the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས།
en: replied the Blessed One. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། གཟུགས་ཀྱི་སྟོང་པ་ཉིད་དང་། གསོག་ཉིད་དང་། གསོབ་ཉིད་དང་།
en: Blessed Lord, is it [the goals], up to and including all-aspect omniscience, that engage in the perfection of wisdom?” “

source: རག་ལུས་པ་ཉིད་དང་། སྙིང་པོ་མ་མཆིས་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་
en: No, Subhūti!”

source: དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་།
en: replied the Blessed One. “

source: ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, is it the emptiness of physical forms—their voidness, vacuity, hollowness, essencelessness, real nature, unmistaken real nature, one and only real nature, reality, realm of phenomena, abiding nature of reality, maturity with respect to all phenomena, very limit of reality, and inconceivable realm—that engage in the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་དང་། གསོག་ཉིད་དང་། གསོབ་ཉིད་དང་། རག་ལུས་པ་ཉིད་དང་། སྙིང་པོ་མ་མཆིས་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, is it the emptiness of feelings, perceptions, formative predispositions, and consciousness—their voidness, vacuity, hollowness, essencelessness, real nature, unmistaken real nature, one and only real nature, reality, realm of phenomena, abiding nature of reality, maturity with respect to all phenomena, very limit of reality, and inconceivable realm—that engage in the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་སྟོང་པ་ཉིད་དང་། གསོག་ཉིད་དང་། གསོབ་ཉིད་དང་། རག་ལུས་པ་ཉིད་དང་། སྙིང་པོ་མ་མཆིས་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་།
en: replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: replied the Blessed One. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་།
en: Blessed Lord, is it the emptiness of the perfections, of all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas {Ki.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་སྟོང་པ་ཉིད་དང་། གསོག་ཉིད་དང་། གསོབ་ཉིད་དང་། རག་ལུས་པ་ཉིད་དང་། སྙིང་པོ་མ་མཆིས་པ་ཉིད་དང་། དེ་བཞིན་ཉིད་དང་།
en: V: 18} and [the goals], up to and including all-aspect omniscience—their voidness, vacuity, hollowness, essencelessness, real nature, unmistaken real nature, one and only real nature, reality, realm of phenomena, abiding nature of reality, maturity with respect to all phenomena, very limit of reality, and inconceivable realm—that engage in the perfection of wisdom?” “

source: མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དམ།
en: No, Subhūti!”

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ། །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད་ན། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཆོས་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཆོས་དེ་ཁྱོད་ཀྱིས་མཐོང་ངམ།
en: Subhūti then asked, “Blessed Lord, if these attributes do not engage in the perfection of wisdom, how then, Blessed Lord, do bodhisattva great beings engage in the perfection of wisdom?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལྟ་བུ་ཁྱོད་ཀྱིས་མཐོང་ངམ།
en: The Blessed One asked in return, “Subhūti, do you think that you can observe the way in which bodhisattva great beings engage in the perfection of wisdom?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: No, Blessed Lord!” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཆོས་གང་ཁྱོད་ཀྱིས་མ་མཐོང་བའི་ཆོས་དེ་དམིགས་སུ་ཡོད་དམ།
en: Subhūti, do you think that anything can be apprehended that you cannot observe?”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཆོས་གང་དམིགས་སུ་མེད་པ་དེ་སྐྱེ་བ་འམ། འགག་པར་འགྱུར་རམ།
en: Subhūti, do you think that there is anything nonapprehensible that arises or ceases?”

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྟེ།
en: This, Subhūti,” continued the Blessed One, “is the acceptance that phenomena are nonarising, which bodhisattva great beings possess.

source: རབ་འབྱོར་བཟོད་པ་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏེ།
en: Subhūti, bodhisattva great beings endowed with such acceptance are prophesied by the lord buddhas to attain unsurpassed, complete enlightenment.

source: རབ་འབྱོར་དེ་ནི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་ལམ་ཞེས་བྱ་སྟེ།
en: This, Subhūti, is said to be the paths of the ten powers, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: ལམ་དེར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སྤྱོད། དེ་ལྟར་རྩོལ། དེ་ལྟར་འབད་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས། ཡེ་ཤེས་ཆེན་པོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་མི་འགྱུར་ཞེས་བྱ་བའི་གནས་མེད་དོ།
en: It is impossible that bodhisattva great beings who enter upon that path, practicing in that manner, striving in that manner, and endeavoring in that manner will not attain the wisdom of unsurpassed, completely awakened buddhahood—the supreme wisdom, the wisdom of all-aspect omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because those bodhisattva great beings have accepted that phenomena are nonarising.

source: དེའི་ཆོས་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ནམ་ཡང་ཡོངས་སུ་འགྲིབ་པར་མི་འགྱུར་རོ།
en: Those attributes that they have will never decrease until they have attained consummate buddhahood in unsurpassed, complete enlightenment.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། ཆོས་ཐམས་ཅད་ཀྱི་མི་སྐྱེ་བ་ཉིད་གང་ལགས་པ་དེ་ལས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་རམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Subhūti then asked, “Blessed Lord, is it through this nonarising nature of all phenomena that bodhisattva great beings are prophesied to attain unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཅི་ལགས། སྐྱེ་བ་ཡང་མ་ལགས། མི་སྐྱེ་བ་ཡང་མ་ལགས་པ་ལས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Subhūti then asked, “Blessed Lord, is it neither through arising nor through nonarising that bodhisattva great beings are prophesied to attain unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་སྐྱེ་བ་ཡང་མ་ལགས། མི་སྐྱེ་བ་ཡང་མ་ལགས་པ་ལས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་མི་བསྟན་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར།
en: Blessed Lord, if is it neither through arising, nor indeed through nonarising, that bodhisattva great beings are prophesied to attain unsurpassed, complete enlightenment, how then are bodhisattva great beings prophesied to attain unsurpassed, complete enlightenment?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་བའི་ཆོས་དེ་ལྟ་བུ་ཁྱོད་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ། གསོལ་པ།
en: The Blessed One asked in return, “Subhūti, do you think that you can observe such phenomena that are prophesied to attain unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ཏེ།
en: No, Blessed Lord!

source: བཅོམ་ལྡན་འདས་ཆོས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་བའི་ཆོས་དེ་དག་ནི་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་།
en: I cannot, Blessed Lord, observe those phenomena that are prophesied to attain unsurpassed, complete enlightenment.
